Moddable-OpenSource/moddable/modules/network/ble/nrf52/modBLEClient.c
/*
 * Copyright (c) 2016-2020  Moddable Tech, Inc.
 *
 *   This file is part of the Moddable SDK Runtime.
 * 
 *   The Moddable SDK Runtime is free software: you can redistribute it and/or modify
 *   it under the terms of the GNU Lesser General Public License as published by
 *   the Free Software Foundation, either version 3 of the License, or
 *   (at your option) any later version.
 * 
 *   The Moddable SDK Runtime is distributed in the hope that it will be useful,
 *   but WITHOUT ANY WARRANTY; without even the implied warranty of
 *   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *   GNU Lesser General Public License for more details.
 * 
 *   You should have received a copy of the GNU Lesser General Public License
 *   along with the Moddable SDK Runtime.  If not, see <http://www.gnu.org/licenses/>.
 *
 */

#include "xsmc.h"
#include "xsHost.h"
#include "mc.xs.h"
#include "mc.defines.h"
#include "modBLE.h"
#include "modBLECommon.h"

#include "sdk_errors.h"
#include "sdk_config.h"
#include "ble.h"
#include "ble_conn_params.h"
#include "ble_gap.h"
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_sdh_freertos.h"
#include "nrf_ble_gatt.h"
#include "nrf_ble_scan.h"
#include "peer_manager.h"
#include "peer_manager_handler.h"

#define APP_BLE_OBSERVER_PRIO 3
#define FIRST_CONN_PARAMS_UPDATE_DELAY      5000                                    /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY       30000                                   /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT        3                                       /**< Number of attempts before giving up the connection parameter negotiation. */

#define LOG_GATTC 0
#if LOG_GATTC
	#define LOG_GATTC_EVENT(event) logGATTCEvent(event)
	#define LOG_GATTC_MSG(msg) modLog(msg)
	#define LOG_GATTC_INT(i) modLogInt(i)
#else
	#define LOG_GATTC_EVENT(event)
	#define LOG_GATTC_MSG(msg)
	#define LOG_GATTC_INT(i)
#endif

#define LOG_GAP 0
#if LOG_GAP
	#define LOG_GAP_EVENT(event) logGAPEvent(event)
	#define LOG_GAP_MSG(msg) modLog(msg)
	#define LOG_GAP_INT(i) modLogInt(i)
#else
	#define LOG_GAP_EVENT(event)
	#define LOG_GAP_MSG(msg)
	#define LOG_GAP_INT(i)
#endif

#define LOG_SCAN 0
#if LOG_SCAN
	#define LOG_SCAN_EVENT(event) logScanEvent(event)
	#define LOG_SCAN_MSG(msg) modLog(msg)
	#define LOG_SCAN_INT(i) modLogInt(i)
#else
	#define LOG_SCAN_EVENT(event)
	#define LOG_SCAN_MSG(msg)
	#define LOG_SCAN_INT(i)
#endif

#define LOG_PM 0
#if LOG_PM
	#define LOG_PM_EVENT(event) logPMEvent(event)
	#define LOG_PM_MSG(msg) modLog(msg)
	#define LOG_PM_INT(i) modLogInt(i)
#else
	#define LOG_PM_EVENT(event)
	#define LOG_PM_MSG(msg)
	#define LOG_PM_INT(i)
#endif

#include "mc.bleservices.c"

typedef enum {
	NONE = 0,
	CHARACTERISTIC_WRITE_VALUE = 1,
	CHARACTERISTIC_WRITE_WITHOUT_RESPONSE,
	CHARACTERISTIC_READ_VALUE,
	DESCRIPTOR_WRITE_VALUE,
	DESCRIPTOR_READ_VALUE
} gattProcedureID;

typedef struct modBLEClientConnectionRecord modBLEClientConnectionRecord;
typedef modBLEClientConnectionRecord *modBLEClientConnection;

typedef struct {
	xsSlot obj;
	uint16_t conn_handle;
	gattProcedureID id;
	ble_uuid_t searchUUID;
	ble_gattc_handle_range_t handle_range;
	uint16_t discovery_handle;
} gattProcedureRecord;

struct modBLEClientConnectionRecord {
	modBLEConnectionPart;
	
	xsSlot objClient;
	
	// gatt procedure
	gattProcedureRecord gattProcedure;
	
	// char_name_table handles
	uint16_t handles[char_name_count];
};

typedef struct modBLEScannedPacketRecord modBLEScannedPacketRecord;
typedef modBLEScannedPacketRecord *modBLEScannedPacket;

struct modBLEScannedPacketRecord {
	struct modBLEScannedPacketRecord *next;

	uint16_t type;
	uint8_t addr[6];
};

typedef struct {
	xsMachine	*the;
	xsSlot		obj;

	// gap
	ble_gap_scan_params_t scan_params;
	nrf_ble_scan_init_t scan_init;
	
	// gatt
	nrf_ble_gatt_t m_gatt;

	// security
	uint8_t encryption;
	uint8_t bonding;
	uint8_t mitm;
	uint8_t iocap;

	// scanning
	uint8_t duplicates;
	modBLEScannedPacket scanned;

	modBLEMessageQueueRecord discoveryQueue;
	modBLEMessageQueueRecord notificationQueue;
} modBLERecord, *modBLE;

typedef struct {
	modBLEMessageQueueEntryPart;
	ble_gap_evt_adv_report_t adv_report;
	uint8_t data[1];
} deviceDiscoveryRecord;

typedef struct {
	modBLEMessageQueueEntryPart;
	uint8_t completed;
	uint16_t count;
	ble_gattc_service_t services[1];
} serviceSearchRecord;

typedef struct {
	modBLEMessageQueueEntryPart;
	uint8_t completed;
	uint16_t count;
	ble_gattc_char_t chars[1];
} characteristicSearchRecord;

typedef struct {
	modBLEMessageQueueEntryPart;
	uint8_t completed;
	uint16_t count;
	ble_gattc_desc_t descs[1];
} descriptorSearchRecord;

typedef struct {
	modBLEMessageQueueEntryPart;
	ble_gattc_evt_hvx_t hvx;
} attributeNotificationRecord;

static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context);
static void pm_evt_handler(pm_evt_t const * p_evt);
static void scan_evt_handler(scan_evt_t const * p_scan_evt);

static void bleClientCloseEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength);
static void bleClientReadyEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength);

static void gapAdvReportEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength);
static void gapAuthKeyRequestEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength);
static void gapAuthStatusEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength);
static void gapConnectedEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength);
static void gapDisconnectedEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength);
static void gapRSSIChangedEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength);

static void gattcCharacteristicDiscoveryEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength);
static void gattcCharacteristicNotificationEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength);
static void gattcCharacteristicReadEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength);
static void gattcCharacteristicWriteEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength);
static void gattcCharacteristicsForDescriptorsDiscoveryEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength);
static void gattcDescriptorDiscoveryEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength);
static void gattcMTUExchangedEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength);
static void gattcServiceDiscoveryEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength);

static void pmConnSecSucceededEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength);

