Moddable-OpenSource/moddable/modules/network/ble/nrf52/modBLEClient.c
	sd_ble_gattc_write(conn_handle, &write_params);
}

void xs_gatt_characteristic_enable_notifications(xsMachine *the)
{
	uint8_t conn_handle = xsmcToInteger(xsArg(0));
	uint16_t characteristic = xsmcToInteger(xsArg(1));
    uint8_t data[2] = {0x01, 0x00};

	modBLEConnection connection = modBLEConnectionFindByConnectionID(conn_handle);
	if (!connection) return;

	writeAttribute(conn_handle, characteristic + 1, BLE_GATT_OP_WRITE_CMD, data, 2);
}

void xs_gatt_characteristic_disable_notifications(xsMachine *the)
{
	uint8_t conn_handle = xsmcToInteger(xsArg(0));
	uint16_t characteristic = xsmcToInteger(xsArg(1));
    uint8_t data[2] = {0x00, 0x00};

	modBLEConnection connection = modBLEConnectionFindByConnectionID(conn_handle);
	if (!connection) return;

	writeAttribute(conn_handle, characteristic + 1, BLE_GATT_OP_WRITE_CMD, data, 2);
}

void xs_gatt_descriptor_write_value(xsMachine *the)
{
	uint16_t argc = xsmcArgc;
	uint8_t conn_handle = xsmcToInteger(xsArg(0));
	uint16_t handle = xsmcToInteger(xsArg(1));
	uint8_t needResponse = 0;
	uint8_t *data;
	uint16_t len;

	modBLEClientConnection connection = (modBLEClientConnection)modBLEConnectionFindByConnectionID(conn_handle);
	if (!connection) return;

	if (argc > 3)
		needResponse = xsmcToInteger(xsArg(3));

	switch (xsmcTypeOf(xsArg(2))) {
		case xsStringType:
			data = xsmcToString(xsArg(2));
			len = c_strlen(data);
			break;
		case xsReferenceType:
			if (xsmcIsInstanceOf(xsArg(2), xsArrayBufferPrototype)) {
				data = xsmcToArrayBuffer(xsArg(2));
				len = xsmcGetArrayBufferLength(xsArg(2));
			}
			else
				goto unknown;
			break;
		unknown:
		default:
			xsUnknownError("unsupported type");
			break;
	}

	c_memset(&connection->gattProcedure, 0, sizeof(gattProcedureRecord));
	connection->gattProcedure.id = DESCRIPTOR_WRITE_VALUE;
	
	writeAttribute(conn_handle, handle, needResponse ? BLE_GATT_OP_WRITE_REQ : BLE_GATT_OP_WRITE_CMD, data, len);
}

void xs_gatt_characteristic_write_without_response(xsMachine *the)
{
	uint8_t conn_handle = xsmcToInteger(xsArg(0));
	uint16_t handle = xsmcToInteger(xsArg(1));
	uint8_t *data;
	uint16_t len;

	modBLEClientConnection connection = (modBLEClientConnection)modBLEConnectionFindByConnectionID(conn_handle);
	if (!connection) return;

	switch (xsmcTypeOf(xsArg(2))) {
		case xsStringType:
			data = xsmcToString(xsArg(2));
			len = c_strlen(data);
			break;
		case xsReferenceType:
			if (xsmcIsInstanceOf(xsArg(2), xsArrayBufferPrototype)) {
				data = xsmcToArrayBuffer(xsArg(2));
				len = xsmcGetArrayBufferLength(xsArg(2));
			}
			else
				goto unknown;
			break;
		unknown:
		default:
			xsUnknownError("unsupported type");
			break;
	}

	c_memset(&connection->gattProcedure, 0, sizeof(gattProcedureRecord));
	connection->gattProcedure.id = CHARACTERISTIC_WRITE_WITHOUT_RESPONSE;

	writeAttribute(conn_handle, handle, BLE_GATT_OP_WRITE_CMD, data, len);
}

void xs_gatt_descriptor_read_value(xsMachine *the)
{
	uint16_t conn_handle = xsmcToInteger(xsArg(0));
	uint16_t handle = xsmcToInteger(xsArg(1));
#if 0
	uint16_t auth = 0;
	uint16_t argc = xsmcArgc;
	if (argc > 2)
		auth = xsmcToInteger(xsArg(2));
#endif
	modBLEClientConnection connection = (modBLEClientConnection)modBLEConnectionFindByConnectionID(conn_handle);
	if (!connection) return;
	
	c_memset(&connection->gattProcedure, 0, sizeof(gattProcedureRecord));
	connection->gattProcedure.id = DESCRIPTOR_READ_VALUE;

	sd_ble_gattc_read(conn_handle, handle, 0);
}

int modBLEConnectionSaveAttHandle(modBLEClientConnection connection, ble_uuid_t *uuid, uint16_t handle)
{
	int result = -1;
	for (int service_index = 0; service_index < service_count; ++service_index) {
		for (int att_index = 0; att_index < attribute_counts[service_index]; ++att_index) {
			const gatts_attr_db_t *att_db = &gatt_db[service_index][att_index];
			const attr_desc_t *att_desc = &att_db->att_desc;
			ble_uuid_t att_desc_uuid;
			bufferToUUID(&att_desc_uuid, att_desc->uuid_p, att_desc->uuid_length);
			if (BLE_UUID_EQ(&att_desc_uuid, uuid)) {
				for (int k = 0; k < char_name_count; ++k) {
					const char_name_table *char_name = &char_names[k];
					if (service_index == char_name->service_index && att_index == char_name->att_index) {
						connection->handles[k] = handle;
						result = k;
						goto bail;
					}
				}
			}
		}
	}
bail:
	return result;
}

static void clearScanned(modBLE ble)
{
	modBLEScannedPacket walker = ble->scanned;
	while (walker) {
		modBLEScannedPacket next = walker->next;
		c_free(walker);
		walker = next;
	}
	ble->scanned = NULL;
}

void bleClientReadyEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	if (!gBLE) return;
	
	for (int service_index = 0; service_index < service_count; ++service_index) {
		const gatts_attr_db_t *att_db = &gatt_db[service_index][0];
		const attr_desc_t *att_desc = &att_db->att_desc;
		
		// register vendor specific 128-bit uuids
		if (UUID_LEN_128 == att_desc->length) {
			uint8_t uuid_type;
			ble_uuid128_t ble_uuid_128;
			ble_uuid_128 = *(ble_uuid128_t*)att_desc->value;
			sd_ble_uuid_vs_add(&ble_uuid_128, &uuid_type);
		}
	}

	xsBeginHost(the);
	xsCall1(gBLE->obj, xsID_callback, xsString("onReady"));
	xsEndHost(the);
}

void bleClientCloseEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	modBLE ble = refcon;
	xs_ble_client_destructor(ble);
}

void gapConnectedEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	if (!gBLE) return;

	ble_gap_evt_t *gap_evt = (ble_gap_evt_t*)message;
	ble_gap_evt_connected_t const * p_evt_connected = (ble_gap_evt_connected_t const *)&gap_evt->params.connected;
	uint16_t conn_handle = gap_evt->conn_handle;
	
	xsBeginHost(gBLE->the);
	
	modBLEConnection connection = modBLEConnectionFindByAddressAndType((uint8_t*)&p_evt_connected->peer_addr.addr, p_evt_connected->peer_addr.addr_type);
	if (!connection)
		xsUnknownError("connection not found");
		
	if (BLE_CONN_HANDLE_INVALID != connection->id)
		goto bail;
		
	connection->id = conn_handle;

	xsmcVars(2);
	xsVar(0) = xsmcNewObject();
	xsmcSetInteger(xsVar(1), conn_handle);
	xsmcSet(xsVar(0), xsID_connection, xsVar(1));
	xsmcSetArrayBuffer(xsVar(1), (uint8_t*)&p_evt_connected->peer_addr.addr[0], BLE_GAP_ADDR_LEN);
	xsmcSet(xsVar(0), xsID_address, xsVar(1));
	xsmcSetInteger(xsVar(1), p_evt_connected->peer_addr.addr_type);
	xsmcSet(xsVar(0), xsID_addressType, xsVar(1));
	xsCall2(gBLE->obj, xsID_callback, xsString("onConnected"), xsVar(0));

