Moddable-OpenSource/moddable/modules/network/ble/nrf52/modBLEClient.c
			if (connection->gattProcedure.discovery_handle < characteristic->handle_value) {
				connection->gattProcedure.handle_range.start_handle = connection->gattProcedure.discovery_handle + 1;
				connection->gattProcedure.handle_range.end_handle = characteristic->handle_decl - 1;
				connection->gattProcedure.discovery_handle = 0;
				modBLEMessageQueueConfigure(&gBLE->discoveryQueue, the, gattcDescriptorDiscoveryEvent, NULL);
				c_free(entry);
				sd_ble_gattc_descriptors_discover(connection->gattProcedure.conn_handle, &connection->gattProcedure.handle_range);
				goto bail;
			}
			if (characteristic->handle_value > end_handle)
				end_handle = characteristic->handle_value;
		}
		c_free(entry);

		connection->gattProcedure.handle_range.start_handle = end_handle + 1;
		sd_ble_gattc_characteristics_discover(connection->id, &connection->gattProcedure.handle_range);
	}

bail:
	xsEndHost(gBLE->the);
}

void gattcDescriptorDiscoveryEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	descriptorSearchRecord *entry;
	uint16_t i, end_handle = 0;
	ret_code_t err_code;

	if (!gBLE) return;
	
	xsBeginHost(gBLE->the);
	while (NULL != (entry = (descriptorSearchRecord*)modBLEMessageQueueDequeue(&gBLE->discoveryQueue))) {		
		modBLEClientConnection connection = (modBLEClientConnection)modBLEConnectionFindByConnectionID(entry->conn_id);
		if (!connection || (connection->id != connection->gattProcedure.conn_handle))
			xsUnknownError("connection not found");
		if (entry->completed) {
			xsCall1(connection->gattProcedure.obj, xsID_callback, xsString("onDescriptor"));
			c_free(entry);
			goto bail;
		}
		for (i = 0; i < entry->count; ++i) {
			uint8_t buffer[UUID_LEN_128];
			uint16_t length;
			ble_gattc_desc_t const *descriptor = &entry->descs[i];
		
			// @@ Likely 128-bit UUID - TBD
			if (BLE_UUID_TYPE_UNKNOWN == descriptor->uuid.type) {
				end_handle = descriptor->handle;
				continue;
			}
			// Don't report CCCDs
			else if (0x2902 == descriptor->uuid.uuid) {
				end_handle = descriptor->handle;
				continue;
			}

			uuidToBuffer(buffer, (ble_uuid_t *)&descriptor->uuid, &length);
			
			int index = modBLEConnectionSaveAttHandle(connection, (ble_uuid_t *)&descriptor->uuid, descriptor->handle);
			
			xsmcVars(2);
			xsVar(0) = xsmcNewObject();
			xsmcSetArrayBuffer(xsVar(1), buffer, length);
			xsmcSet(xsVar(0), xsID_uuid, xsVar(1));
			xsmcSetInteger(xsVar(1), descriptor->handle);
			xsmcSet(xsVar(0), xsID_handle, xsVar(1));
		
			if (-1 != index) {
				xsmcSetString(xsVar(1), (char*)char_names[index].name);
				xsmcSet(xsVar(0), xsID_name, xsVar(1));
				xsmcSetString(xsVar(1), (char*)char_names[index].type);
				xsmcSet(xsVar(0), xsID_type, xsVar(1));
			}
			xsCall2(connection->gattProcedure.obj, xsID_callback, xsString("onDescriptor"), xsVar(0));
		
			end_handle = descriptor->handle;
		}
		c_free(entry);

		connection->gattProcedure.handle_range.start_handle = end_handle + 1;
		err_code = sd_ble_gattc_descriptors_discover(connection->gattProcedure.conn_handle, &connection->gattProcedure.handle_range);
		if (NRF_SUCCESS != err_code)
			xsCall1(connection->gattProcedure.obj, xsID_callback, xsString("onDescriptor"));
	}
	
bail:
	xsEndHost(gBLE->the);
}

void gattcCharacteristicReadEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	if (!gBLE) return;
	
	ble_gattc_evt_read_rsp_t const *read_rsp = (ble_gattc_evt_read_rsp_t const *)message;
	uint32_t conn_handle = (uint32_t)refcon;

	xsBeginHost(gBLE->the);
	modBLEClientConnection connection = (modBLEClientConnection)modBLEConnectionFindByConnectionID(conn_handle);
	if (!connection)
		xsUnknownError("connection not found");
	
	xsmcVars(2);
	xsVar(0) = xsmcNewObject();
	xsmcSetArrayBuffer(xsVar(1), (void*)read_rsp->data, read_rsp->len);
	xsmcSet(xsVar(0), xsID_value, xsVar(1));
	xsmcSetInteger(xsVar(1), read_rsp->handle);
	xsmcSet(xsVar(0), xsID_handle, xsVar(1));
	
	xsCall2(connection->objClient, xsID_callback, xsString(connection->gattProcedure.id == CHARACTERISTIC_READ_VALUE ? "onCharacteristicValue" : "onDescriptorValue"), xsVar(0));
	
	xsEndHost(gBLE->the);
}

static void gattcCharacteristicNotificationEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	attributeNotificationRecord *entry;

	if (!gBLE) return;

	xsBeginHost(gBLE->the);
	xsmcVars(2);
	while (NULL != (entry = (attributeNotificationRecord*)modBLEMessageQueueDequeue(&gBLE->notificationQueue))) {
		modBLEClientConnection connection = (modBLEClientConnection)modBLEConnectionFindByConnectionID(entry->conn_id);
		if (!connection)
			xsUnknownError("connection not found");
		ble_gattc_evt_hvx_t const *hvx = (ble_gattc_evt_hvx_t const *)&entry->hvx;
		xsVar(0) = xsmcNewObject();
		xsmcSetArrayBuffer(xsVar(1), (void*)hvx->data, hvx->len);
		xsmcSet(xsVar(0), xsID_value, xsVar(1));
		xsmcSetInteger(xsVar(1), hvx->handle);
		xsmcSet(xsVar(0), xsID_handle, xsVar(1));
		xsCall2(connection->objClient, xsID_callback, xsString("onCharacteristicNotification"), xsVar(0));
		c_free(entry);
	}
	xsEndHost(gBLE->the);
}

static void gattcCharacteristicWriteEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	if (!gBLE) return;
	
	ble_gattc_evt_write_rsp_t const *write_rsp = (ble_gattc_evt_write_rsp_t const *)message;
	uint32_t conn_handle = (uint32_t)refcon;

	xsBeginHost(gBLE->the);
	modBLEClientConnection connection = (modBLEClientConnection)modBLEConnectionFindByConnectionID(conn_handle);
	if (!connection)
		xsUnknownError("connection not found");
		
	xsmcVars(2);
	xsVar(0) = xsmcNewObject();
	xsmcSetInteger(xsVar(1), write_rsp->handle);
	xsmcSet(xsVar(0), xsID_handle, xsVar(1));
	xsCall2(connection->objClient, xsID_callback, xsString("onDescriptorWritten"), xsVar(0));
bail:
	xsEndHost(gBLE->the);
}

static void gattcMTUExchangedEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	if (!gBLE) return;
	
	ble_gattc_evt_exchange_mtu_rsp_t const *mtu = (ble_gattc_evt_exchange_mtu_rsp_t const *)message;
	uint32_t conn_handle = (uint32_t)refcon;

	modBLEConnection connection = modBLEConnectionFindByConnectionID(conn_handle);
	if (!connection || !connection->mtu_exchange_pending) return;
	
	connection->mtu_exchange_pending = 0;
	xsBeginHost(gBLE->the);
	xsCall2(connection->objConnection, xsID_callback, xsString("onMTUExchanged"), xsInteger(mtu->server_rx_mtu));
	xsEndHost(gBLE->the);
}

