Moddable-OpenSource/moddable/modules/network/ble/nrf52/modBLEClient.c
static void logGAPEvent(uint16_t evt_id) {
	switch(evt_id) {
		case BLE_GAP_EVT_CONNECTED: modLog("BLE_GAP_EVT_CONNECTED"); break;
		case BLE_GAP_EVT_DISCONNECTED: modLog("BLE_GAP_EVT_DISCONNECTED"); break;
		case BLE_GAP_EVT_CONN_PARAM_UPDATE: modLog("BLE_GAP_EVT_CONN_PARAM_UPDATE"); break;
		case BLE_GAP_EVT_SEC_PARAMS_REQUEST: modLog("BLE_GAP_EVT_SEC_PARAMS_REQUEST"); break;
		case BLE_GAP_EVT_SEC_INFO_REQUEST: modLog("BLE_GAP_EVT_SEC_INFO_REQUEST"); break;
		case BLE_GAP_EVT_PASSKEY_DISPLAY: modLog("BLE_GAP_EVT_PASSKEY_DISPLAY"); break;
		case BLE_GAP_EVT_KEY_PRESSED: modLog("BLE_GAP_EVT_KEY_PRESSED"); break;
		case BLE_GAP_EVT_AUTH_KEY_REQUEST: modLog("BLE_GAP_EVT_AUTH_KEY_REQUEST"); break;
		case BLE_GAP_EVT_LESC_DHKEY_REQUEST: modLog("BLE_GAP_EVT_LESC_DHKEY_REQUEST"); break;
		case BLE_GAP_EVT_AUTH_STATUS: modLog("BLE_GAP_EVT_AUTH_STATUS"); break;
		case BLE_GAP_EVT_CONN_SEC_UPDATE: modLog("BLE_GAP_EVT_CONN_SEC_UPDATE"); break;
		case BLE_GAP_EVT_TIMEOUT: modLog("BLE_GAP_EVT_TIMEOUT"); break;
		case BLE_GAP_EVT_RSSI_CHANGED: modLog("BLE_GAP_EVT_RSSI_CHANGED"); break;
		case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST: modLog("BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST"); break;
		case BLE_GAP_EVT_SCAN_REQ_REPORT: modLog("BLE_GAP_EVT_SCAN_REQ_REPORT"); break;
		case BLE_GAP_EVT_PHY_UPDATE_REQUEST: modLog("BLE_GAP_EVT_PHY_UPDATE_REQUEST"); break;
		case BLE_GAP_EVT_PHY_UPDATE: modLog("BLE_GAP_EVT_PHY_UPDATE"); break;
		case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST: modLog("BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST"); break;
		case BLE_GAP_EVT_DATA_LENGTH_UPDATE: modLog("BLE_GAP_EVT_DATA_LENGTH_UPDATE"); break;
		case BLE_GAP_EVT_QOS_CHANNEL_SURVEY_REPORT: modLog("BLE_GAP_EVT_QOS_CHANNEL_SURVEY_REPORT"); break;
		case BLE_GAP_EVT_ADV_REPORT: modLog("BLE_GAP_EVT_ADV_REPORT"); break;
		case BLE_GAP_EVT_ADV_SET_TERMINATED: modLog("BLE_GAP_EVT_ADV_SET_TERMINATED"); break;

        case BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP: modLog("BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP"); break;
        case BLE_GATTC_EVT_REL_DISC_RSP: modLog("BLE_GATTC_EVT_REL_DISC_RSP"); break;
        case BLE_GATTC_EVT_CHAR_DISC_RSP: modLog("BLE_GATTC_EVT_CHAR_DISC_RSP"); break;
        case BLE_GATTC_EVT_DESC_DISC_RSP: modLog("BLE_GATTC_EVT_DESC_DISC_RSP"); break;
        case BLE_GATTC_EVT_ATTR_INFO_DISC_RSP: modLog("BLE_GATTC_EVT_ATTR_INFO_DISC_RSP"); break;
        case BLE_GATTC_EVT_CHAR_VAL_BY_UUID_READ_RSP: modLog("BLE_GATTC_EVT_CHAR_VAL_BY_UUID_READ_RSP"); break;
        case BLE_GATTC_EVT_READ_RSP: modLog("BLE_GATTC_EVT_READ_RSP"); break;
        case BLE_GATTC_EVT_CHAR_VALS_READ_RSP: modLog("BLE_GATTC_EVT_CHAR_VALS_READ_RSP"); break;
        case BLE_GATTC_EVT_WRITE_RSP: modLog("BLE_GATTC_EVT_WRITE_RSP"); break;
        case BLE_GATTC_EVT_HVX: modLog("BLE_GATTC_EVT_HVX"); break;
        case BLE_GATTC_EVT_EXCHANGE_MTU_RSP: modLog("BLE_GATTC_EVT_EXCHANGE_MTU_RSP"); break;
        case BLE_GATTC_EVT_TIMEOUT: modLog("BLE_GATTC_EVT_TIMEOUT"); break;
        case BLE_GATTC_EVT_WRITE_CMD_TX_COMPLETE: modLog("BLE_GATTC_EVT_WRITE_CMD_TX_COMPLETE"); break;
	}
}

void ble_evt_handler(const ble_evt_t *p_ble_evt, void * p_context)
{
    uint32_t err_code;

	if (!gBLE) return;
	
	LOG_GAP_EVENT(p_ble_evt->header.evt_id);
	
    switch (p_ble_evt->header.evt_id)
    {
    	case BLE_GAP_EVT_ADV_REPORT: {
			ble_gap_evt_adv_report_t const * p_evt_adv_report = &p_ble_evt->evt.gap_evt.params.adv_report;
			if (0 != p_evt_adv_report->data.len) {
				deviceDiscoveryRecord *entry = c_malloc(sizeof(deviceDiscoveryRecord) - 1 + p_evt_adv_report->data.len);
				if (NULL != entry) {
					entry->conn_id = p_ble_evt->evt.gap_evt.conn_handle;
					entry->adv_report = *p_evt_adv_report;
					c_memmove(entry->data, p_evt_adv_report->data.p_data, p_evt_adv_report->data.len);
					modBLEMessageQueueEnqueue(&gBLE->discoveryQueue, (modBLEMessageQueueEntry)entry);
				}
			}
   			break;
    	}
		case BLE_GAP_EVT_AUTH_KEY_REQUEST:
			modMessagePostToMachine(gBLE->the, (uint8_t*)&p_ble_evt->evt.gap_evt, sizeof(ble_gap_evt_t), gapAuthKeyRequestEvent, NULL);
			break;
		case BLE_GAP_EVT_CONNECTED: {
			uint8_t encrypted = 0;
			if (0xFF != gBLE->iocap) {
				pm_conn_sec_status_t status = {0};
				encrypted = ((NRF_SUCCESS == pm_conn_sec_status_get(p_ble_evt->evt.gap_evt.conn_handle, &status)) && status.encrypted);
				if (!encrypted)
					pm_handler_secure_on_connection(p_ble_evt);
			}
			modMessagePostToMachine(gBLE->the, (uint8_t*)&p_ble_evt->evt.gap_evt, sizeof(ble_gap_evt_t), gapConnectedEvent, NULL);
			if (encrypted)
				modMessagePostToMachine(gBLE->the, NULL, 0, pmConnSecSucceededEvent, NULL);
			break;
		}
		case BLE_GAP_EVT_DISCONNECTED:
			modMessagePostToMachine(gBLE->the, (uint8_t*)&p_ble_evt->evt.gap_evt, sizeof(ble_gap_evt_t), gapDisconnectedEvent, NULL);
			break;
        case BLE_GAP_EVT_PASSKEY_DISPLAY:
			modMessagePostToMachine(gBLE->the, (uint8_t*)&p_ble_evt->evt.gap_evt, sizeof(ble_gap_evt_t), gapPasskeyDisplayEvent, NULL);
        	break;
        case BLE_GAP_EVT_RSSI_CHANGED:
			modMessagePostToMachine(gBLE->the, (uint8_t*)&p_ble_evt->evt.gap_evt, sizeof(ble_gap_evt_t), gapRSSIChangedEvent, NULL);
			sd_ble_gap_rssi_stop(p_ble_evt->evt.gap_evt.conn_handle);       	
        	break;
		case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST: {
			ble_gap_data_length_params_t dlp;
			dlp.max_rx_octets = BLE_GAP_DATA_LENGTH_AUTO;
			dlp.max_tx_octets = BLE_GAP_DATA_LENGTH_AUTO;
			dlp.max_rx_time_us = BLE_GAP_DATA_LENGTH_AUTO;
			dlp.max_tx_time_us = BLE_GAP_DATA_LENGTH_AUTO;
			sd_ble_gap_data_length_update(p_ble_evt->evt.gap_evt.conn_handle, &dlp, NULL);
			break;
		}
		case BLE_GAP_EVT_PHY_UPDATE_REQUEST: {
			ble_gap_phys_t const phys = {
				.rx_phys = BLE_GAP_PHY_AUTO,
				.tx_phys = BLE_GAP_PHY_AUTO,
			};
			sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
			break;
		}
			
		case BLE_GATTC_EVT_CHAR_DISC_RSP: {
			characteristicSearchRecord *entry;
			ble_gattc_evt_char_disc_rsp_t const *char_disc_rsp = &p_ble_evt->evt.gattc_evt.params.char_disc_rsp;
			uint16_t len = sizeof(characteristicSearchRecord) + ((char_disc_rsp->count - 1) * sizeof(ble_gattc_char_t));
			entry = c_malloc(len);
			if (NULL != entry) {
				entry->conn_id = p_ble_evt->evt.gattc_evt.conn_handle;
				entry->completed = p_ble_evt->evt.gattc_evt.gatt_status != 0;
				entry->count = char_disc_rsp->count;
				c_memmove(entry->chars, char_disc_rsp->chars, char_disc_rsp->count * sizeof(ble_gattc_char_t));
				modBLEMessageQueueEnqueue(&gBLE->discoveryQueue, (modBLEMessageQueueEntry)entry);
			}
			break;
		}
		case BLE_GATTC_EVT_DESC_DISC_RSP: {
			descriptorSearchRecord *entry;
			ble_gattc_evt_desc_disc_rsp_t const *desc_disc_rsp = &p_ble_evt->evt.gattc_evt.params.desc_disc_rsp;
			uint16_t len = sizeof(descriptorSearchRecord) + ((desc_disc_rsp->count - 1) * sizeof(ble_gattc_desc_t));
			entry = c_malloc(len);
			if (NULL != entry) {
				entry->conn_id = p_ble_evt->evt.gattc_evt.conn_handle;
				entry->completed = p_ble_evt->evt.gattc_evt.gatt_status != 0;	
				entry->count = desc_disc_rsp->count;
				c_memmove(entry->descs, desc_disc_rsp->descs, desc_disc_rsp->count * sizeof(ble_gattc_desc_t));
				modBLEMessageQueueEnqueue(&gBLE->discoveryQueue, (modBLEMessageQueueEntry)entry);
			}
			break;
		}
        case BLE_GATTC_EVT_EXCHANGE_MTU_RSP:
			if (BLE_GATT_STATUS_SUCCESS == p_ble_evt->evt.gattc_evt.gatt_status) {
				ble_gattc_evt_exchange_mtu_rsp_t const *mtu = &p_ble_evt->evt.gattc_evt.params.exchange_mtu_rsp;
				modMessagePostToMachine(gBLE->the, (uint8_t*)mtu, sizeof(ble_gattc_evt_exchange_mtu_rsp_t), gattcMTUExchangedEvent, (void*)(uint32_t)p_ble_evt->evt.gattc_evt.conn_handle);
			}
        	break;
        case BLE_GATTC_EVT_HVX:
			if (BLE_GATT_STATUS_SUCCESS == p_ble_evt->evt.gattc_evt.gatt_status) {
				attributeNotificationRecord *entry;
				ble_gattc_evt_hvx_t const *hvx = &p_ble_evt->evt.gattc_evt.params.hvx;
				entry = c_malloc(sizeof(attributeNotificationRecord) + hvx->len - 1);
				if (NULL != entry) {
					entry->conn_id = p_ble_evt->evt.gattc_evt.conn_handle;
					c_memmove(&entry->hvx, hvx, sizeof(ble_gattc_evt_hvx_t) - 1 + hvx->len);
					modBLEMessageQueueEnqueue(&gBLE->notificationQueue, (modBLEMessageQueueEntry)entry);
				}
			}
        	break;
		case BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP: {
			serviceSearchRecord *entry;
			ble_gattc_evt_prim_srvc_disc_rsp_t const *prim_srvc_disc_rsp = &p_ble_evt->evt.gattc_evt.params.prim_srvc_disc_rsp;
			uint16_t len = sizeof(serviceSearchRecord) + ((prim_srvc_disc_rsp->count - 1) * sizeof(ble_gattc_service_t));
			entry = c_malloc(len);
			if (NULL != entry) {
				entry->conn_id = p_ble_evt->evt.gattc_evt.conn_handle;
				entry->completed = p_ble_evt->evt.gattc_evt.gatt_status != 0;	
				entry->count = prim_srvc_disc_rsp->count;
				c_memmove(entry->services, prim_srvc_disc_rsp->services, prim_srvc_disc_rsp->count * sizeof(ble_gattc_service_t));
				modBLEMessageQueueEnqueue(&gBLE->discoveryQueue, (modBLEMessageQueueEntry)entry);
			}
			break;
		}
        case BLE_GATTC_EVT_READ_RSP:
			if (BLE_GATT_STATUS_SUCCESS == p_ble_evt->evt.gattc_evt.gatt_status) {
				ble_gattc_evt_read_rsp_t const *read_rsp = &p_ble_evt->evt.gattc_evt.params.read_rsp;
				modMessagePostToMachine(gBLE->the, (uint8_t*)read_rsp, sizeof(ble_gattc_evt_read_rsp_t) + read_rsp->len - 1, gattcCharacteristicReadEvent, (void*)(uint32_t)p_ble_evt->evt.gattc_evt.conn_handle);
			}
        	break;
        case BLE_GATTC_EVT_WRITE_RSP:
			if (BLE_GATT_STATUS_SUCCESS == p_ble_evt->evt.gattc_evt.gatt_status) {
				ble_gattc_evt_write_rsp_t const *write_rsp = &p_ble_evt->evt.gattc_evt.params.write_rsp;
				modMessagePostToMachine(gBLE->the, (uint8_t*)write_rsp, sizeof(ble_gattc_evt_write_rsp_t) + write_rsp->len - 1, gattcCharacteristicWriteEvent, (void*)(uint32_t)p_ble_evt->evt.gattc_evt.conn_handle);
			}
        	break;
        	
        default:
            break;
    }
}

static void logPMEvent(uint16_t evt_id) {
	switch(evt_id) {
		case PM_EVT_BONDED_PEER_CONNECTED: modLog("PM_EVT_BONDED_PEER_CONNECTED"); break;
		case PM_EVT_CONN_SEC_START: modLog("PM_EVT_CONN_SEC_START"); break;
		case PM_EVT_CONN_SEC_SUCCEEDED: modLog("PM_EVT_CONN_SEC_SUCCEEDED"); break;
		case PM_EVT_CONN_SEC_FAILED: modLog("PM_EVT_CONN_SEC_FAILED"); break;
		case PM_EVT_CONN_SEC_CONFIG_REQ: modLog("PM_EVT_CONN_SEC_CONFIG_REQ"); break;
		case PM_EVT_CONN_SEC_PARAMS_REQ: modLog("PM_EVT_CONN_SEC_PARAMS_REQ"); break;
		case PM_EVT_STORAGE_FULL: modLog("PM_EVT_STORAGE_FULL"); break;
		case PM_EVT_ERROR_UNEXPECTED: modLog("PM_EVT_ERROR_UNEXPECTED"); break;
		case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED: modLog("PM_EVT_PEER_DATA_UPDATE_SUCCEEDED"); break;
		case PM_EVT_PEER_DATA_UPDATE_FAILED: modLog("PM_EVT_PEER_DATA_UPDATE_FAILED"); break;
		case PM_EVT_PEER_DELETE_SUCCEEDED: modLog("PM_EVT_PEER_DELETE_SUCCEEDED"); break;
		case PM_EVT_PEERS_DELETE_FAILED: modLog("PM_EVT_PEERS_DELETE_FAILED"); break;
		case PM_EVT_LOCAL_DB_CACHE_APPLIED: modLog("PM_EVT_LOCAL_DB_CACHE_APPLIED"); break;
		case PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED: modLog("PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED"); break;
		case PM_EVT_SERVICE_CHANGED_IND_SENT: modLog("PM_EVT_SERVICE_CHANGED_IND_SENT"); break;
		case PM_EVT_SERVICE_CHANGED_IND_CONFIRMED: modLog("PM_EVT_SERVICE_CHANGED_IND_CONFIRMED"); break;
		case PM_EVT_SLAVE_SECURITY_REQ: modLog("PM_EVT_SLAVE_SECURITY_REQ"); break;
		case PM_EVT_FLASH_GARBAGE_COLLECTED: modLog("PM_EVT_FLASH_GARBAGE_COLLECTED"); break;
		case PM_EVT_FLASH_GARBAGE_COLLECTION_FAILED: modLog("PM_EVT_FLASH_GARBAGE_COLLECTION_FAILED"); break;
	}
}

void pm_evt_handler(pm_evt_t const * p_evt)
{
	LOG_PM_EVENT(p_evt->evt_id);
	
	pm_handler_on_pm_evt(p_evt);
	pm_handler_disconnect_on_sec_failure(p_evt);
	pm_handler_flash_clean(p_evt);

